<?xml version="1.0" ?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="?,640,640,3"/>
			<rt_info>
				<attribute name="fused_names" value="input_1" version="0"/>
				<attribute name="old_api_map_order" value="0, 2, 3, 1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,input_1:0" precision="FP32">
					<dim>-1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1/Transpose([0 3 1 2])/value4378757208" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="input_1/Transpose([0 3 1 2])/value4378757208" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="input_1/Transpose([0 3 1 2])" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/u_net/model/bn_Conv1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="32, 3, 3, 3" size="3456"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/bn_Conv1/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/Conv1/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/u_net/model/Conv1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/Conv1/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_3408734092" type="Const" version="opset1">
			<data element_type="f32" offset="3488" shape="1, 32, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3408734092" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/u_net/model/bn_Conv1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/bn_Conv1/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/bn_Conv1/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/u_net/model/Conv1_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/Conv1_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/Conv1_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="3616" shape="32, 1, 1, 3, 3" size="1152"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_3409534100" type="Const" version="opset1">
			<data element_type="f32" offset="4768" shape="1, 32, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3409534100" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/expanded_conv_depthwise_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/u_net/model/expanded_conv_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="4896" shape="16, 32, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/expanded_conv_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/expanded_conv_project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/u_net/model/expanded_conv_project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/expanded_conv_project/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="data_add_3410334108" type="Const" version="opset1">
			<data element_type="f32" offset="6944" shape="1, 16, 1, 1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3410334108" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/u_net/model/expanded_conv_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/expanded_conv_project_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/expanded_conv_project_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/u_net/model/block_1_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="7008" shape="96, 16, 1, 1" size="6144"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_1_expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/u_net/model/block_1_expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_expand/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_3411134116" type="Const" version="opset1">
			<data element_type="f32" offset="13152" shape="1, 96, 1, 1" size="384"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3411134116" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/u_net/model/block_1_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_expand_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_1_expand_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/u_net/model/block_1_expand_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_expand_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/block_1_expand_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/u_net/model/block_1_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="13536" shape="96, 1, 1, 3, 3" size="3456"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_1_depthwise/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/u_net/model/block_1_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_depthwise/depthwise, StatefulPartitionedCall/u_net/model/block_1_pad/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_3411934124" type="Const" version="opset1">
			<data element_type="f32" offset="16992" shape="1, 96, 1, 1" size="384"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3411934124" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/u_net/model/block_1_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_1_depthwise_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/u_net/model/block_1_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_depthwise_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/block_1_depthwise_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/u_net/model/block_1_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="17376" shape="24, 96, 1, 1" size="9216"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_1_project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/u_net/model/block_1_project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_project/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_3412734132" type="Const" version="opset1">
			<data element_type="f32" offset="26592" shape="1, 24, 1, 1" size="96"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3412734132" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/u_net/model/block_1_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_1_project_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_1_project_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/u_net/model/block_2_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="26688" shape="144, 24, 1, 1" size="13824"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_2_expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/u_net/model/block_2_expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_expand/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_3413534140" type="Const" version="opset1">
			<data element_type="f32" offset="40512" shape="1, 144, 1, 1" size="576"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3413534140" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/u_net/model/block_2_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_expand_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_2_expand_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/u_net/model/block_2_expand_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_expand_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/block_2_expand_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/u_net/model/block_2_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="41088" shape="144, 1, 1, 3, 3" size="5184"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_2_depthwise/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/u_net/model/block_2_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_depthwise/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_3414334148" type="Const" version="opset1">
			<data element_type="f32" offset="46272" shape="1, 144, 1, 1" size="576"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3414334148" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/u_net/model/block_2_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_2_depthwise_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/u_net/model/block_2_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_depthwise_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/block_2_depthwise_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/u_net/model/block_2_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="46848" shape="24, 144, 1, 1" size="13824"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_2_project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/u_net/model/block_2_project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_project/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_3415134156" type="Const" version="opset1">
			<data element_type="f32" offset="60672" shape="1, 24, 1, 1" size="96"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3415134156" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/u_net/model/block_2_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_project_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_2_project_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/u_net/model/block_2_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_2_add/add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_2_add/add:0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/u_net/model/block_3_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="60768" shape="144, 24, 1, 1" size="13824"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_3_expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/u_net/model/block_3_expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_expand/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="data_add_3415934164" type="Const" version="opset1">
			<data element_type="f32" offset="74592" shape="1, 144, 1, 1" size="576"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3415934164" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/u_net/model/block_3_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_expand_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_3_expand_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/u_net/model/block_3_expand_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_expand_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/block_3_expand_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/u_net/model/block_3_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="75168" shape="144, 1, 1, 3, 3" size="5184"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_3_depthwise/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/u_net/model/block_3_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_depthwise/depthwise, StatefulPartitionedCall/u_net/model/block_3_pad/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_3416734172" type="Const" version="opset1">
			<data element_type="f32" offset="80352" shape="1, 144, 1, 1" size="576"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3416734172" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/u_net/model/block_3_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_3_depthwise_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/u_net/model/block_3_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_depthwise_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/block_3_depthwise_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/u_net/model/block_3_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="80928" shape="32, 144, 1, 1" size="18432"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_3_project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/u_net/model/block_3_project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_project/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_3417534180" type="Const" version="opset1">
			<data element_type="f32" offset="99360" shape="1, 32, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3417534180" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/u_net/model/block_3_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_3_project_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_3_project_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/u_net/model/block_4_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="99488" shape="192, 32, 1, 1" size="24576"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_4_expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/u_net/model/block_4_expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_expand/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="data_add_3418334188" type="Const" version="opset1">
			<data element_type="f32" offset="124064" shape="1, 192, 1, 1" size="768"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3418334188" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/u_net/model/block_4_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_expand_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_4_expand_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/u_net/model/block_4_expand_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_expand_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/block_4_expand_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/u_net/model/block_4_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="124832" shape="192, 1, 1, 3, 3" size="6912"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_4_depthwise/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/u_net/model/block_4_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_depthwise/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_3419134196" type="Const" version="opset1">
			<data element_type="f32" offset="131744" shape="1, 192, 1, 1" size="768"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3419134196" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/u_net/model/block_4_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_4_depthwise_BN/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/u_net/model/block_4_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_depthwise_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/u_net/model/block_4_depthwise_relu/Relu6:0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/u_net/model/block_4_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="132512" shape="32, 192, 1, 1" size="24576"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/u_net/model/block_4_project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/u_net/model/block_4_project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_project/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_3419934204" type="Const" version="opset1">
			<data element_type="f32" offset="157088" shape="1, 32, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_3419934204" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/u_net/model/block_4_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/u_net/model/block_4_project_BN/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/u_net/model/block_4_project_BN/FusedBatchNormV3:0" precision="FP32">
